# EndVectorFill

## Description
Procedure EndVectorFill ends the vector fill creation process. This procedure call must follow the BeginVectorFillN call and a variable number of AddVectorFillLayer calls.

```pascal
PROCEDURE EndVectorFill;
```

```python
def vs.EndVectorFill():
    return None
```

## Remarks
Follows BeginVectorFill and a variable number AddVectorFillLayer calls.

## Examples
AddHatchToResource

```pascal
EndVectorFill;
```
```python
import vs

# Procedure EndVectorFill ends the vector fill creation process.
vs.EndVectorFill()
```

## Version
Availability: from MiniCAD7.0.1

## Category
* Hatches @ Vector Fills